from typing import TypedDict
from random import randrange, choices, shuffle, randint
from flask import Flask, request, render_template
from flask_socketio import SocketIO, emit
import os
import sys

# 環境設定
GOAL = 30
WEIGHT_FACTOR = 1


# Flaskの初期設定
app = Flask(__name__, template_folder="../dist", static_folder="../dist/assets")
app.config["SECRET_KEY"] = "secretkey"
socketio = SocketIO(app, cors_allowed_origins="*")

class Player(TypedDict):
  name: str
  position: int
  sid: str


class Game:
  num_members = 0

  game_state = {
    "players": [],
    "turn": 0,
    "current_player": 0,
    "goal": GOAL,  # TODO: 仮
    "event_list": [],
    "log": []
  }

  # 約2000問
  question = [[['however'], ['しかしながら，どんなに～でも']], [['environment'], ['環境，状況']], [['reduce'], ['を減らす，縮小する']], [['instead'], ['代わりに，その代わり']], [['vehicle'], ['乗り物，車']], [['recommend'], ['を推薦する，を勧める']], [['improve'], ['を改善する，改良する']], [['recently'], ['最近，このごろ']], [['customer'], ['顧客，お客様']], [['several'], ['幾つかの，いくらかの']], [['discover'], ['を発見する，見つける']], [['common'], ['共通の，共同の']], [['disturb'], ['を阻害する，(人の)邪魔をする']], [['moreover'], ['さらに，その上']], [['benefit'], ['利益／に利益をもたらす']], [['solution'], ['解決法，解明']], [['inform'], ['情報を与える，に知らせる']], [['unable'], ['できない，不能である']], [['disease'], ['病気，疾患']], [['therefore'], ['それゆえ，だから']], [['unfortunately'], ['残念なことに，不幸にも']], [['device'], ['装置，仕掛け']], [['attractive'], ['魅力的な，興味をそそる']], [['climate'], ['気候，天候']], [['evidence'], ['証拠，証明']], [['estimate'], ['を推定する，評価する']], [['argue'], ['だと主張する，感情的に論じる']], [['meanwhile'], ['一方で，他方で']], [['entirely'], ['完全に，全く']], [['publish'], ['を出版する，発行する']], [['melt'], ['溶ける，を溶かす']], [['expense'], ['費用，出費，犠牲']], [['contain'], ['を含む，が入っている']], [['similar'], ['似ている，類似の']], [['government'], ['政府，行政府，内閣']], [['modern'], ['現代的な，現代の']], [['million'], ['100万']], [['quit'], ['やめる，中止する']], [['scientist'], ['科学者，研究者']], [['pollution'], ['汚染，汚れ，汚染物']], [['foundation'], ['土台，根拠，設立']], [['remove'], ['を取り除く，を除去する']], [['compare'], ['を比較する，をたとえる']], [['replace'], ['を取り換える，を交換する']], [['furthermore'], ['さらに，その上']], [['profit'], ['利益，もうけ']], [['remain'], ['のままである，残る']], [['organize'], ['を組織する，を編成する']], [['emphasize'], ['を強調する，力説する']], [['experiment'], ['実験，試み']], [['consume'], ['を消費する，消耗する']], [['development'], ['発展，発達，開発']], [['detect'], ['を検出する，を感知する']], [['extremely'], ['極端に，過度に']], [['employment'], ['雇用，採用']], [['unlike'], ['と異なって，とは違って']], [['properly'], ['適切に，適当に']], [['repair'], ['を修理する，修繕する']], [['complicated'], ['複雑な，繁雑な']], [['until'], ['までに，まで']], [['arrest'], ['を逮捕する，捕まえる']], [['betray'], ['を裏切る，をだます']], [['survey'], ['調査／を見渡す']], [['affect'], ['に影響を与える，に作用する']], [['consider'], ['について考える，だと見なす']], [['portable'], ['持ち運べる，携帯用の']], [['remind'], ['に思い出させる，に気付かせる']], [['ability'], ['能力，力量']], [['allow'], ['を許可する，許す']], [['quality'], ['質，特性']], [['construction'], ['建設，構造，建造物']], [['develop'], ['を発達させる，を開発する']], [['permission'], ['許可，認可']], [['mess'], ['混乱，錯乱，無秩序']], [['convert'], ['を変える，転換する']], [['resident'], ['住民，居住者']], [['provide'], ['を供給する，提供する']], [['metal'], ['金属，合金']], [['immediately'], ['即座に，直ちに']], [['predict'], ['を予想する，を予測する']], [['religion'], ['宗教，信仰']], [['currency'], ['通貨，流通']], [['restore'], ['を元に戻す，を修復する']], [['accompany'], ['に付き添う，に同行する']], [['nevertheless'], ['にも関わらず，けれども']], [['probably'], ['おそらく，大抵']], [['additionally'], ['加えて，さらに，追加で']], [['anxiety'], ['心配，不安']], [['brain'], ['頭脳，脳']], [['certain'], ['ある，確信している']], [['pain'], ['痛み，苦痛']], [['involve'], ['を含む，を巻き込む']], [['preserved'], ['保存された，保管された']], [['accurate'], ['正確な，的確な']], [['analyze'], ['を分析する，分解する']], [['obtain'], ['を手に入れる，を獲得する']], [['sympathy'], ['同情，思いやり']], [['flexibility'], ['しなやかさ，弾力性，柔軟性']], [['approach'], ['に近づく，接近する']], [['manage'], ['何とかうまくやる，管理を行う']], [['artificial'], ['人工的な，人造の']], [['slightly'], ['わずかに，少し']], [['measure'], ['措置，測るもの／を測る']], [['waste'], ['を浪費する／浪費，廃棄物']], [['fertilizer'], ['肥料，育成剤']], [['adopt'], ['を自分のものにする，を取り入れる']], [['raise'], ['を上げる，持ち上げる']], [['avoid'], ['を避ける，を回避する']], [['achieve'], ['を達成する，到達する']], [['tolerate'], ['に耐える，寛大に取り扱う']], [['journey'], ['旅，旅行']], [['production'], ['生産，製造']], [['cell'], ['細胞，マス目']], [['complete'], ['完全な，全部の']], [['annually'], ['毎年の，年一回ずつ']], [['psychologist'], ['心理学者，精神科学者']], [['demand'], ['要求，需要／を要求する']], [['respond'], ['反応する，と返答する']], [['valuable'], ['貴重な，価値のある']], [['witness'], ['目撃者，証人／を目撃する']], [['poverty'], ['貧困，貧乏，困窮']], [['embarrass'], ['を恥ずかしがらせる，を恥じさせる']], [['enlarge'], ['を拡大する，を広げる']], [['ingredient'], ['材料，原料，成分']], [['overall'], ['全体的な，全部の']], [['spend'], ['を費やす，使う']], [['purchase'], ['を購入する／購入']], [['brilliant'], ['優れた，光り輝く']], [['revolution'], ['革命，変革']], [['previously'], ['以前は，前もって']], [['feature'], ['特徴，特性／を目玉とする']], [['excuse'], ['言い訳，弁解／を許す']], [['decrease'], ['減少する，を減らす／減少']], [['frequent'], ['頻繁な，しばしば起こる']], [['theory'], ['理論，学説']], [['gravity'], ['重力，引力']], [['translate'], ['を翻訳する，通訳する']], [['equipment'], ['装置，設備']], [['rare'], ['まれな，珍しい']], [['decide'], ['決心する，解決する']], [['amount'], ['量，額']], [['constant'], ['絶え間ない，一定の']], [['efficient'], ['効率のいい，効率的な']], [['available'], ['利用できる，使用可能な']], [['particular'], ['特定の，明確な']], [['locate'], ['見つける，位置を突きとめる']], [['recommendation'], ['推薦，推奨']], [['politely'], ['丁寧に，礼儀正しく']], [['accidentally'], ['誤って，知らずに']], [['satisfy'], ['を満足させる，を喜ばせる']], [['appointment'], ['予定，約束']], [['chemical'], ['化学物質／化学の']], [['attach'], ['を貼り付ける，を貼る']], [['permit'], ['を許可する，を認める']], [['prevent'], ['を妨げる，予防する']], [['increase'], ['を増やす，増大させる']], [['luxury'], ['贅沢な／贅沢']], [['decade'], ['10年間']], [['enormous'], ['非常に大きい，極端に大きい']], [['replacement'], ['置換，代替']], [['confuse'], ['を混乱させる，区別がつかない']], [['produce'], ['を生産する，産出する']], [['economy'], ['経済，節約']], [['celebrate'], ['祝う，祝福する']], [['imitate'], ['模倣する，真似る']], [['assignment'], ['割り当て，配分']], [['certainly'], ['確かに，間違いなく']], [['behave'], ['振る舞う，立ち振舞う']], [['instrument'], ['楽器，音楽器具']], [['temporary'], ['一時的な，短期的な']], [['arrange'], ['整える，を配置する']], [['occasion'], ['特定の時，行事，祭典']], [['promote'], ['を促進する，を推進する']], [['electricity'], ['電力，電気']], [['composer'], ['作曲，楽曲制作']], [['creature'], ['生き物，生物']], [['substance'], ['物質，実態']], [['graduate'], ['を卒業する，を修了する']], [['furniture'], ['家具，調度品']], [['medicine'], ['薬，医薬品']], [['attitude'], ['態度，姿勢']], [['borrow'], ['を借りる，を借用する']], [['sufficient'], ['十分な，足りている']], [['directly'], ['直接，直接的に']], [['historic'], ['由緒のある，歴史に残る']], [['barely'], ['かろうじて，やっと']], [['delete'], ['を削除する，消す']], [['urgent'], ['緊急の，急を要する']], [['generous'], ['気前のよい，寛容な']], [['cruel'], ['残酷な，ひどい']], [['celebration'], ['お祝い，祝典']], [['reflection'], ['反響，反射']], [['concept'], ['概念，観念']], [['whisper'], ['ささやく，を耳打ちする']], [['deposit'], ['お金を預ける，を預金する']], [['apology'], ['謝罪，お詫び']], [['deceive'], ['を欺く，をだます']], [['establish'], ['を設立する，創設する']], [['endure'], ['を我慢する，耐える']], [['dispose'], ['廃棄，処分']], [['statistics'], ['統計，数字']], [['compromise'], ['妥協，和解']], [['terminal'], ['終りの，末端の']], [['formation'], ['形成，構成']], [['envelope'], ['封筒，封書']], [['quarrel'], ['喧嘩，口論，言い争い']], [['handle'], ['を手で扱う，に対処する／取っ手']], [['condition'], ['状態，条件，情勢']], [['punish'], ['を罰する，懲らしめる']], [['despite'], ['にも関わらず，けれども']], [['worth'], ['の価値がある，（～するに）値する']], [['spread'], ['を広げる，広がる']], [['luckily'], ['幸いなことに，幸運にも']], [['taste'], ['味，風味／な味がする']], [['confident'], ['自信のある，確信している']], [['sight'], ['見ること，視力']], [['electric'], ['電気の，電力の']], [['receive'], ['を受理する，受け取る']], [['ankle'], ['足首，くるぶし']], [['fear'], ['を恐れる，恐がる／恐れ']], [['active'], ['活動的な，活気のある']], [['lesser'], ['より少ない，いっそう少ない']], [['degree'], ['程度，度']], [['effect'], ['効果，影響，結果']], [['cause'], ['原因／の原因となる']], [['particularly'], ['特に，とりわけ']], [['suffer'], ['を患う，苦しむ']], [['immune'], ['免疫の，免疫のある']], [['disorder'], ['無秩序，混乱']], [['mental'], ['精神の，心の']], [['physical'], ['身体の，肉体の']], [['opportunity'], ['機会，好機']], [['exceptionally'], ['例外的に，非常に']], [['almost'], ['ほとんど，たいてい']], [['characteristic'], ['特有の，独特の']], [['civilization'], ['文明，文明社会']], [['represent'], ['を表す，を代表する']], [['collapse'], ['崩壊する，つぶれる']], [['insult'], ['を侮辱する，を罵る']], [['mixture'], ['混合物，複合体']], [['isolated'], ['孤立した，隔離された']], [['punctual'], ['規則正しい，時間通りの']], [['responsible'], ['責任がある，責任が伴う']], [['frightened'], ['恐ろしかった，怖かった']], [['guarantee'], ['を保証する／保証']], [['blame'], ['を非難する，批判する']], [['anniversary'], ['～周年，記念日']], [['violate'], ['違反する，破る']], [['delay'], ['を遅らせる，先延ばしにする']], [['surround'], ['を取り囲む，を包囲する']], [['immigrate'], ['移住する，移転する']], [['correct'], ['正確な／を訂正する']], [['landscape'], ['風景，眺め']], [['instinct'], ['直感，本能，勘']], [['policy'], ['政策，方針']], [['obviously'], ['明らかに，明白に']], [['strangely'], ['不思議なことに，奇妙に']], [['chase'], ['を追跡する，追いかける／追跡']], [['pour'], ['を注ぐ，激しく降る']], [['issue'], ['問題，（雑誌などの）号']], [['elderly'], ['年配の，高齢の']], [['brightness'], ['輝度，明るさ']], [['indoor'], ['室内／屋内の']], [['senior'], ['ポストが上の／年上の人']], [['natural'], ['当然の，自然の']], [['specific'], ['具体的な，特定の']], [['symmetry'], ['対称，左右対称']], [['advantage'], ['有利，利点']], [['knee'], ['膝']], [['copyright'], ['著作権，版権']], [['charge'], ['非難，料金，管理／に請求する']], [['director'], ['監督，指導者，役員']], [['actually'], ['実際に，現実に']], [['compose'], ['を構成する，作曲する']], [['greet'], ['を出迎える，に挨拶する']], [['temple'], ['お寺，寺院']], [['heritage'], ['遺産，相続財産']], [['abroad'], ['外国で，外国へ']], [['population'], ['人口，国民']], [['bring'], ['持って来る，連れてくる']], [['environmental'], ['環境の，自然環境の']], [['garbage'], ['生ゴミ，くず']], [['environmentally'], ['環境的に，情勢的に']], [['council'], ['議会，会議']], [['fuel'], ['燃料，燃えやすいもの']], [['process'], ['過程，手順／を加工処理する']], [['ban'], ['を禁止する／禁止']], [['harm'], ['害，危害／を害する']], [['unbelievable'], ['信じられない，信じがたい']], [['innocent'], ['罪のない，無罪の']], [['arrogant'], ['傲慢な，横柄な']], [['harbor'], ['港，港湾']], [['temper'], ['気性，かんしゃく']], [['legend'], ['伝説，言い伝え']], [['fairly'], ['かなり，公平に']], [['vague'], ['漠然とした，あいまいな']], [['harvest'], ['収穫／を収穫する']], [['assistance'], ['支援，手伝い']], [['conflict'], ['対立，争い']], [['planet'], ['惑星，天体']], [['ruin'], ['を台無しにする，破滅する／破滅']], [['launch'], ['発売する，船をおろす']], [['withdraw'], ['を撤回する，引き下がる/引き出す']], [['refuse'], ['を拒否する，拒む']], [['embrace'], ['を抱きしめる，擁する']], [['overtake'], ['追い越す，追いつく']], [['restrict'], ['を制限する，を限定する']], [['instruction'], ['指示，指導']], [['stock'], ['株，在庫／を在庫に持つ']], [['competitor'], ['競合他社，競争相手']], [['spectator'], ['観客，見物人']], [['explorer'], ['冒険者，探検家']], [['equal'], ['同等，等しい']], [['solve'], ['を解決する，解消する']], [['childhood'], ['子供時代，幼少期']], [['sustainable'], ['存続可能な，持続可能な']], [['leftover'], ['残り物，食べ残し']], [['efficiency'], ['効率，能率']], [['arrangement'], ['配置，配列']], [['treat'], ['を扱う，待遇する']], [['muscle'], ['筋肉，筋力']], [['aspect'], ['局面，側面，表情']], [['content'], ['中身，内容，目次']], [['prescription'], ['処方，処方箋']], [['anxious'], ['心配して，不安な']], [['ancient'], ['古代の，大昔の']], [['generously'], ['惜しみなく，気前よく']], [['literature'], ['文学，文芸']], [['deadline'], ['締め切り，期限']], [['exception'], ['例外，特例']], [['temporarily'], ['一時的に，仮に']], [['fund'], ['基金，資金']], [['accomplish'], ['を成し遂げる，完成する']], [['introduce'], ['紹介する，引き合わす']], [['overlap'], ['重ねる，積む']], [['identify'], ['を見分ける，識別する']], [['collaboration'], ['共同，共作，協力']], [['detective'], ['探偵，刑事，捜査官']], [['democracy'], ['民主主義，民主制度']], [['modify'], ['を変更する，を修正する']], [['stir'], ['をかき混ぜる, 混ぜる']], [['roll'], ['転がる, 転ぶ']], [['orbit'], ['軌道, 軌跡']], [['frequently'], ['頻繁に, たびたび']], [['emotionally'], ['感情的に, 情緒的に']], [['evaluate'], ['評価する，見積もる']], [['defend'], ['を守る，保護する']], [['district'], ['地域，地区']], [['purpose'], ['目的，目標']], [['prayer'], ['祈り，礼拝']], [['prospect'], ['見込み，眺め']], [['victim'], ['犠牲者，被害者']], [['distant'], ['遠く離れた, 遠隔の']], [['various'], ['様々な，多様な']], [['visible'], ['目に見える, 可視的']], [['wrap'], ['を包む，巻きつける']], [['dig'], ['を掘る，採掘する']], [['angle'], ['角度, 角']], [['payment'], ['支払い，支出']], [['once'], ['かつて，1度']], [['publisher'], ['出版社，出版会社']], [['dizzy'], ['めまいがする，ふらふらする']], [['postpone'], ['を延期する，を先送りする']], [['justify'], ['正当化する，合理化する']], [['fulfill'], ['満たす，充足する']], [['influence'], ['影響，影響力，波及／影響を及ぼす']], [['capacity'], ['容量，容積']], [['continent'], ['大陸，陸地']], [['industry'], ['産業，工業']], [['surface'], ['表面，水面']], [['doubtfully'], ['疑わしく，怪しい']], [['permanently'], ['恒久的に，永遠に']], [['sensitive'], ['敏感な，感じやすい']], [['peaceful'], ['平和な，安らかな']], [['medical'], ['医学の，医療の']], [['critics'], ['評論家，批評家']], [['explorers'], ['探検家，冒険家']], [['obstacle'], ['障害，妨害']], [['admit'], ['を認める，入ることを許す']], [['react'], ['反応する，返答する']], [['succeed'], ['成功する，達成する']], [['disappear'], ['消える，見えなくなる']], [['beyond'], ['～を越えたところに，～を超えた場所に']], [['observe'], ['を観察する，を監視する']], [['participant'], ['参加者，出席者']], [['tight'], ['狭い，締まった']], [['social'], ['社会の，共同体の']], [['jealously'], ['嫉妬深く，妬み深く']], [['reliable'], ['信頼性のある，あてになる']], [['stable'], ['安定した，安泰な']], [['transport'], ['を輸送する，を運搬する']], [['precious'], ['貴重な，大切な']], [['vaccine'], ['ワクチン，予防接種']], [['neverthless'], ['にも関わらず，けれども']], [['illness'], ['病気，疾患']], [['checkup'], ['健康診断，照合']], [['temperature'], ['温度，気温']], [['inconvenience'], ['不便，不自由']], [['unusually'], ['異常に，めったにないほど']], [['determine'], ['を決める，を定める']], [['genetically'], ['遺伝的に，生まれながら']], [['diet'], ['食事，食事療法']], [['major'], ['専攻科目，主要科目']], [['sign'], ['標識，印，合図']], [['progress'], ['進歩，前進']], [['offensive'], ['攻撃的な，無礼な']], [['abrupt'], ['突然の，不意の']], [['familiar'], ['見慣れた，よく知られた']], [['distributor'], ['卸売業者，問屋']], [['publicity'], ['宣伝，周知']], [['separation'], ['分離，区分']], [['reuse'], ['を再利用する，再使用する']], [['strike'], ['叩く，打つ']], [['protest'], ['抗議する，主張する']], [['illustrate'], ['を説明する，を例示する']], [['voluntarily'], ['自発的に，自ら進んで']], [['consciously'], ['意識的に，故意に']], [['approximately'], ['約，おおよそ']], [['peacefully'], ['平和的に，穏やかに']], [['burden'], ['負担，重荷']], [['whistle'], ['口笛を吹く，口笛をする']], [['voyage'], ['航海，航行']], [['envy'], ['妬み，羨望']], [['exaggerate'], ['を誇張する，大げさに言う']], [['matter'], ['問題，困ったこと']], [['individual'], ['個人の，個々の']], [['transportation'], ['交通，輸送']], [['smell'], ['においがする，臭いがする']], [['recognize'], ['認識する，はっきりと知る']], [['treatment'], ['扱い，処理']], [['expired'], ['期限切れの，契約の切れた']], [['fee'], ['料金，手数料']], [['current'], ['現在の，現行の']], [['renew'], ['を更新する，新しくする']], [['unexpected'], ['意外な，突然の']], [['economic'], ['経済の，財政の']], [['breath'], ['息，呼吸']], [['humidity'], ['湿度，湿気']], [['gradually'], ['次第に，だんだんに']], [['ceiling'], ['天井，屋根']], [['sculpture'], ['彫刻，彫像']], [['exact'], ['ちょうど，正確な']], [['produce'], ['生産する，作り出す']], [['warm'], ['暖かい，温暖な']], [['inside'], ['中身，内部']], [['ill'], ['病気で，気分の悪い']], [['research'], ['研究／研究する']], [['relative'], ['相対的な，比較上の，親戚']], [['poison'], ['毒，毒物']], [['completely'], ['完全に，全く']], [['absorb'], ['を吸収する，吸い取る']], [['feed'], ['餌を与える，育てる']], [['effective'], ['効果的な，有用な']], [['container'], ['容器，入れ物']], [['dedicate'], ['に専念する，奉納する']], [['abandon'], ['を捨て去る，放棄する']], [['amuse'], ['楽しませる，娯楽を提供する']], [['range'], ['範囲，幅']], [['sphere'], ['球，球体']], [['revenge'], ['に復讐する/復讐']], [['popularity'], ['人気，流行']], [['suspicious'], ['疑わしい，怪しい']], [['delicate'], ['繊細な，きめ細かい']], [['welfare'], ['福祉，幸福']], [['border'], ['国境，境界']], [['habit'], ['習慣，慣行']], [['interrupt'], ['割り込む，中断する']], [['persuade'], ['を説得する，口説き落とす']], [['examine'], ['を検査する，調査する']], [['leisurely'], ['のんびりした，気の長い']], [['bravely'], ['勇敢に，りっぱに']], [['relatively'], ['比較的，相対的に']], [['substitute'], ['代用品／代わりに用いる']], [['peel'], ['皮，表皮']], [['hospitality'], ['おもてなし，歓待']], [['tragedy'], ['悲劇，悲惨な出来事']], [['instruct'], ['指示する，教える']], [['gather'], ['を集める，収集する']], [['appear'], ['現れる，出現する']], [['hesitate'], ['ためらう，躊躇する']], [['alternative'], ['代替物，代案']], [['depression'], ['落ち込み，不景気']], [['rug'], ['じゅうたん，敷き物']], [['invent'], ['を発明する，創造する']], [['encourage'], ['を勇気づける，励ます']], [['rarely'], ['めったに～ない，稀に']], [['digest'], ['要約／消化する']], [['vocabulary'], ['単語，語彙']], [['complex'], ['複雑な，複合の']], [['strengthen'], ['強化する，増強する']], [['similarly'], ['同様に，一様に']], [['ignorance'], ['無知，無学']], [['opposite'], ['反対の，向こう側の']], [['pronunciation'], ['発音，発声']], [['invention'], ['発明，創造']], [['reverse'], ['反対の，裏側の']], [['commute'], ['通勤する，取り替える']], [['appeal'], ['訴える，告発する，告訴する']], [['qualify'], ['に資格を与える，認可する']], [['incident'], ['出来事，事件']], [['market'], ['市場，市場経済']], [['maximum'], ['最大，最大の']], [['yell'], ['大声で叫ぶ，大声を出す']], [['sneeze'], ['くしゃみ／くしゃみをする']], [['wipe'], ['を拭く，拭き取る']], [['twist'], ['ねじれ，より合わせる']], [['civilize'], ['文明化する，開化させる']], [['murder'], ['殺人，凶行']], [['impose'], ['を課す，負わせる']], [['parliament'], ['議会，国会']], [['glance'], ['一目見る／一目']], [['aid'], ['援助／助ける']], [['force'], ['力，勢い']], [['role'], ['役割，職務']], [['acquaint'], ['知人／に知らせる']], [['superior'], ['より優れた，優越な']], [['knowledge'], ['知識，学識']], [['mindful'], ['気をつけて，注意深く']], [['appearance'], ['出現，外見']], [['incredible'], ['信じられない，信じがたい']], [['article'], ['記事，論文']], [['ancestor'], ['祖先，先祖']], [['bend'], ['曲げる，湾曲させる']], [['occur'], ['発生する，起こる']], [['objection'], ['異議，反対']], [['lazy'], ['怠け者の，ぐうたらの']], [['outstanding'], ['並外れた，目立った']], [['construct'], ['を組み立てる，建設する']], [['adequate'], ['適切で，十分な']], [['mildly'], ['穏やかに，静かに']], [['scar'], ['傷跡，痕跡']], [['hesitantly'], ['躊躇して，もじもじして']], [['wealthy'], ['裕福な，豊かな']], [['forget'], ['を忘れる，忘れ去る']], [['stranger'], ['他人，他者']], [['prove'], ['を証明する，立証する']], [['insurance'], ['保険，保障']], [['generation'], ['世代，年代']], [['conclude'], ['を締めくくる，終える']], [['violence'], ['暴力，乱暴']], [['irritate'], ['イライラさせる，怒らせる']], [['tourism'], ['観光，観覧']], [['commit'], ['専念，ゆだねる']], [['maintain'], ['を維持する，保つ']], [['favor'], ['親切な行為，好意']], [['differ'], ['異なる，違う']], [['though'], ['だけれども，しかし']], [['limb'], ['手足，四肢']], [['eventually'], ['結局は，やがて']], [['suggest'], ['を提案する，勧める']], [['capture'], ['を捕まえる，捉える']], [['psychology'], ['心理学，精神科学']], [['export'], ['を輸出する，輸送する']], [['spill'], ['をこぼす，溢れる']], [['identity'], ['同一性，一致性']], [['participate'], ['参加する，出席する']], [['cough'], ['咳払いする/咳']], [['include'], ['を含む，内包する']], [['sincerely'], ['心から，真心こめて']], [['improvement'], ['改善，改良']], [['crime'], ['犯罪，罪行']], [['spiritually'], ['精神的に，心の中で']], [['proposal'], ['提案，勧告']], [['confess'], ['を打ち明ける，白状する']], [['credit'], ['信用，信頼']], [['reservation'], ['予約，確保']], [['translation'], ['翻訳，訳文']], [['disadvantage'], ['不利益，不利な立場，損失']], [['objectively'], ['客観的に，冷静に']], [['consumption'], ['消費，消費高']], [['innocently'], ['無邪気に，素直に']], [['researcher'], ['研究者，調査員']], [['location'], ['位置，場所']], [['oxygen'], ['酸素，O2']], [['neglect'], ['を無視する，放っておく']], [['survive'], ['生き残る，存続する']], [['desert'], ['砂漠，乾燥地帯']], [['donation'], ['寄贈，寄付']], [['exhibit'], ['示す，表示する']], [['principal'], ['主要な，基本的な']], [['product'], ['製品，商品']], [['formal'], ['形式の，形状の']], [['persuasion'], ['説得，口説き']], [['huge'], ['巨大な，広大な']], [['migrate'], ['移行する，移住する']], [['logical'], ['論理的な，論理上の']], [['interpret'], ['を解釈する，受け取る']], [['accuracy'], ['正確さ，精密']], [['contribution'], ['寄付，貢献']], [['climb'], ['登る，よじ登る']], [['preserve'], ['保存／を保存する']], [['laundry'], ['洗濯物，クリーニング店']], [['deal'], ['を扱う，分配する']], [['intensive'], ['集中的な，強調の']], [['budget'], ['予算，経費']], [['mummy'], ['ミイラ，乾燥死体']], [['dizziness'], ['めまい，立ち眩み']], [['occasionally'], ['時折，稀に']], [['audience'], ['聴衆，観客']], [['liquid'], ['液体，流体']], [['combine'], ['を結合させる，合同する']], [['imply'], ['をほのめかす，暗示する']], [['applause'], ['拍手かっさい，称賛']], [['ridiculous'], ['ばかげている，不合理な']], [['ignore'], ['を無視する，見逃す']], [['mammal'], ['哺乳類']], [['indeed'], ['実に，全く']], [['fossil'], ['化石，遺跡']], [['obvious'], ['明白な，明瞭な']], [['precise'], ['正確な，的確な']], [['happen'], ['起こる，発生する']], [['argument'], ['議論，口論']], [['visually'], ['視覚的に，目で見て']], [['terribly'], ['ひどく，ものすごく']], [['direction'], ['方向，方角']], [['astonish'], ['ひどく驚かす，驚かせる']], [['divide'], ['を分割する，分ける']], [['distract'], ['気を散らす，気をそらす']], [['describe'], ['を述べる，描写する']], [['opinion'], ['意見，考え']], [['finally'], ['ついに，やっと']], [['frown'], ['しかめっ面，顔をしかめる']], [['culture'], ['文化，教養']], [['overcome'], ['を克服する，乗り越える']], [['figure'], ['形，姿']], [['inspire'], ['鼓舞する，励ます']], [['prize'], ['賞，報酬']], [['accomplishment'], ['完成，成果']], [['suburb'], ['郊外，近郊']], [['drag'], ['引っ張る，引きずる']], [['mineral'], ['無機物，非生物']], [['escape'], ['逃れる，脱走する']], [['tremble'], ['震える，おののく']], [['genuine'], ['本物の，純粋な']], [['needlessly'], ['不必要に，無用に']], [['during'], ['～の間，～の間ずっと']], [['island'], ['島，島々']], [['property'], ['財産，所有物']], [['deaf'], ['耳が不自由な，耳が聞こえない']], [['masterpiece'], ['傑作，名作']], [['admission'], ['入場，入場料']], [['retire'], ['退職する，引退する']], [['deliver'], ['配達する，届ける']], [['draw'], ['描く，引っ張る']], [['factory'], ['工場，製造所']], [['create'], ['創造する，考案する']], [['rather'], ['むしろ，どちらかといえば']], [['threat'], ['脅威，危機']], [['tropical'], ['熱帯の，熱帯気候の']], [['vital'], ['極めて重要な，生命の']], [['agricultural'], ['農業の，農作物の']], [['altogether'], ['完全に，まったく']], [['quantity'], ['量，数値']], [['male'], ['男性，雄']], [['insist'], ['強く主張する，断言する']], [['hesitation'], ['ためらい，躊躇']], [['conversation'], ['会話，対話']], [['ordinary'], ['ふつうの，いつもの']], [['illustration'], ['図解，実例']], [['expensive'], ['高価な，費用のかかる']], [['expect'], ['予期する，予想する']], [['concentration'], ['集中，専念']], [['thermometer'], ['温度計，気温計']], [['advertisement'], ['広告，宣伝']], [['debt'], ['借金，負債']], [['investigate'], ['調査する，研究する']], [['description'], ['説明書，記述']], [['bother'], ['面倒／迷惑をかける']], [['punishment'], ['罰，罰則']], [['propose'], ['を提案する，申し出る']], [['flame'], ['火炎，炎']], [['ambulance'], ['救急車，救援車']], [['intense'], ['激しい，熱心な']], [['impossible'], ['不可能な，実現不可能な']], [['curiosity'], ['好奇心，探究心']], [['organization'], ['組織，団体，協会']], [['submit'], ['を提出する，に服従する']], [['immigration'], ['移住，入国管理']], [['convince'], ['を納得させる，説得する']], [['declare'], ['を宣言する，公表する']], [['vain'], ['うぬぼれの強い，自惚れた']], [['resource'], ['資源，資産']], [['domestic'], ['国内の，家庭の']], [['affection'], ['愛情，好意']], [['recent'], ['最近の，新しい']], [['discovery'], ['発見，見つけること']], [['stimulate'], ['を刺激する，元気づける']], [['college'], ['大学，高等教育機関']], [['academically'], ['学問的に，知識的に']], [['grass'], ['草']], [['praise'], ['をほめる／賞賛']], [['dentist'], ['歯医者，歯科医']], [['truly'], ['真に，正確に']], [['cling'], ['くっつく，接着する']], [['clip'], ['切る，切り取る／クリップ']], [['reaction'], ['反応，反響']], [['conventional'], ['従来の，伝統的な']], [['relieve'], ['和らげる，軽減する']], [['seek'], ['求める，捜し出す']], [['forever'], ['永遠に，ずっと']], [['intervention'], ['介在，仲裁']], [['historian'], ['歴史家，史学者']], [['whether'], ['どちらか，いずれか']], [['ethnic'], ['民族の，民族特有の']], [['swear'], ['誓う，宣誓する']], [['responsibility'], ['責任，義務']], [['opponent'], ['相手，対象']], [['blow'], ['吹く，吹き飛ばす']], [['history'], ['歴史，過去']], [['society'], ['社会，共同体']], [['mature'], ['成熟した，大人の']], [['democratic'], ['民主主義の，民主政治の']], [['manager'], ['部長，支配人']], [['definition'], ['定義，明確な説明']], [['abstract'], ['抽象的な，非具体的な']], [['recover'], ['回復する，元に戻る']], [['notion'], ['考え，意見']], [['reject'], ['拒絶する，断る']], [['chamber'], ['小部屋，個室']], [['desire'], ['願望／切望する']], [['distinguish'], ['を区別する，識別する']], [['warn'], ['警告する，警戒する']], [['excess'], ['過剰，超過']], [['numerous'], ['多数の，多くの']], [['harmony'], ['調和，一致']], [['fail'], ['失敗する，うまくいかない']], [['gentle'], ['穏やかな，物柔らかな']], [['enforcement'], ['執行，実施']], [['trait'], ['特性，特色']], [['deficit'], ['赤字，欠損']], [['source'], ['情報源，原因']], [['representative'], ['代表者，代理人']], [['commitment'], ['約束，委託']], [['worry'], ['心配させる，心配する']], [['bitter'], ['苦い，えぐい']], [['assess'], ['評価する，査定する']], [['prosecution'], ['起訴，告訴']], [['discussion'], ['議論，討論']], [['drift'], ['漂流，流れる']], [['troop'], ['群れ，集団']], [['crack'], ['裂け目，ひび']], [['output'], ['生産量，製造量']], [['relation'], ['関係性，相互作用']], [['law'], ['法律，制度']], [['share'], ['分かち合う／分け前']], [['assist'], ['手伝う，促進する']], [['later'], ['後に，以後']], [['resolution'], ['解決，決意']], [['welcome'], ['歓迎される，迎えられる']], [['ensure'], ['を確実にする，を保証する']], [['classical'], ['古典の，古代の']], [['merely'], ['単に，ただ']], [['according'], ['による，準じて']], [['occupation'], ['職業，仕事']], [['proportion'], ['比率，割合']], [['anger'], ['怒り，憤り']], [['delivery'], ['配達，送付']], [['annoy'], ['いらだたせる，怒らせる']], [['civilian'], ['民間人，一般市民']], [['craft'], ['工芸，技能']], [['appreciate'], ['感謝する，ありがたがる']], [['corridor'], ['廊下，通路']], [['plenty'], ['たくさん，多く']], [['virtue'], ['徳，道徳']], [['pleasure'], ['楽しみ，喜び']], [['bored'], ['退屈した，つまらない']], [['behavior'], ['振る舞い，態度']], [['conscious'], ['意識して，気をつけて']], [['objective'], ['目標，目的']], [['education'], ['教育，指導']], [['regional'], ['地方の，地域の']], [['controversial'], ['議論の的になる，論争上の']], [['investigator'], ['捜査官，探偵']], [['slide'], ['滑る，滑走する']], [['seat'], ['を着席させる／座席']], [['tap'], ['軽くたたく，軽く打つ']], [['manner'], ['やり方，方法']], [['therapy'], ['治療，療法']], [['compete'], ['競争する，争う']], [['representation'], ['表現，表示']], [['tear'], ['を引き裂く，を裂く']], [['crucial'], ['重要な，決定的な']], [['creative'], ['創造的な，独創的な']], [['realize'], ['だとわかる，実現する']], [['physics'], ['物理学，物理科学']], [['invest'], ['に投資する，資本をつぎ込む']], [['satisfaction'], ['満足，充足']], [['dust'], ['ほこり，塵']], [['possible'], ['可能な，実現可能な']], [['tremendous'], ['非常に大きな，極めて大きい']], [['typically'], ['典型的に，一般的に']], [['awareness'], ['気づき，認識']], [['quite'], ['かなり，相当に']], [['committee'], ['委員会，会議']], [['dependent'], ['依存している，頼っている']], [['especially'], ['特に，格段に']], [['deputy'], ['代理，代わり']], [['extent'], ['程度，大きさ']], [['subject'], ['教科，主題']], [['horror'], ['恐怖，怖さ']], [['salary'], ['給与，報酬']], [['grand'], ['壮大な，雄大な']], [['guide'], ['案内人／案内する']], [['vessel'], ['容器，器']], [['cooperation'], ['協力，共同作業']], [['interfere'], ['に干渉する，介入する']], [['recall'], ['呼び戻す，思い出す']], [['patience'], ['辛抱強さ，忍耐力']], [['venture'], ['冒険的事業，投機的事業']], [['annual'], ['毎年の，年毎の']], [['fair'], ['公平な，平等な']], [['bill'], ['請求書，勘定書']], [['behind'], ['背後に，後方に']], [['suppose'], ['だと思う，と仮定する']], [['provision'], ['供給，支給']], [['depend'], ['依存する，頼る']], [['myth'], ['神話，神話伝説']], [['sink'], ['沈む，沈没する']], [['pregnant'], ['妊娠している，妊娠中の']], [['derive'], ['を引き出す，取り出す']], [['practically'], ['実質的に，実用的に']], [['elaborate'], ['手の込んだ，複雑な']], [['refugee'], ['難民，避難者']], [['motive'], ['動機，意欲']], [['ally'], ['と同盟する，連合する']], [['minimum'], ['最小の，最も小さな']], [['attorney'], ['弁護士，代理人']], [['commissioner'], ['委員，理事']], [['clue'], ['手がかり，糸口']], [['minister'], ['大臣，牧師']], [['arrival'], ['到着，到達']], [['technical'], ['技術上の，専門的な']], [['similarity'], ['類似点，相似']], [['fully'], ['十分に，完全に']], [['nowhere'], ['どこにも，どこにでも']], [['hunger'], ['飢え，空腹']], [['pretend'], ['のふりをする，に成りすます']], [['perception'], ['知覚，認知']], [['leap'], ['飛び跳ねる，飛び越える']], [['lie'], ['横たわる，寝転ぶ']], [['tongue'], ['言葉，舌']], [['success'], ['成功，達成']], [['candidate'], ['候補者，志願者']], [['hate'], ['ひどく嫌う，深く憎む']], [['notice'], ['気づく／通知']], [['mystery'], ['神秘的な／神秘']], [['dignity'], ['威厳，尊厳']], [['senate'], ['上院，上院議会']], [['contemporary'], ['現在の，現代の']], [['previous'], ['前の，以前の']], [['fiber'], ['繊維，糸']], [['oppose'], ['反対する，抵抗する']], [['creation'], ['創造，創作']], [['Jewish'], ['ユダヤ人，ユダヤ教徒']], [['reputation'], ['評判，評価']], [['rude'], ['失礼な，無礼な']], [['ritual'], ['儀式，式典']], [['historical'], ['歴史上の，過去の']], [['opposition'], ['反対，対立']], [['structure'], ['構造，建造物']], [['percentage'], ['割合，比率']], [['enter'], ['入る，入場する']], [['install'], ['導入する，導く']], [['tip'], ['先，前方']], [['state'], ['状態，状況']], [['adjust'], ['を調節する，調整する']], [['physician'], ['医師，内科医']], [['labor'], ['労働，労働者']], [['international'], ['国際的な，国際レベルの']], [['strongly'], ['強く，激しく']], [['arms'], ['武器，兵器']], [['household'], ['家族，世帯']], [['nation'], ['国家，国土']], [['jury'], ['陪審員，審査員']], [['former'], ['前の，以前の']], [['illegal'], ['違法の，不正な']], [['circumstance'], ['状況，環境']], [['wan'], ['青ざめた，蒼白な']], [['spoil'], ['台無しにする，損なう']], [['composition'], ['構成，制作']], [['tail'], ['尾，尾部']], [['majority'], ['大多数，多数派']], [['beside'], ['の横に，隣に']], [['operation'], ['操作，作用']], [['talent'], ['才能，能力']], [['pleasant'], ['楽しい，愉快な']], [['era'], ['時代，世代']], [['ultimate'], ['究極の，最後の']], [['telescope'], ['望遠鏡，遠望鏡']], [['originate'], ['始まる，起こす']], [['delight'], ['喜び，歓喜']], [['whenever'], ['する時はいつでも，する際は常に']], [['operate'], ['操作する，操る']], [['consistent'], ['一貫した，矛盾のない']], [['exhaust'], ['疲れ果てさせる，消耗させる']], [['twin'], ['双子，二卵性双生児']], [['fix'], ['固定する，修理する']], [['enhance'], ['強調する，(さらに)高める']], [['defendant'], ['被告人，告発される人']], [['negotiation'], ['交渉，話し合い']], [['face'], ['直面する／顔']], [['immediate'], ['即座の，瞬時の']], [['instant'], ['瞬間，瞬時']], [['bloody'], ['血の，血液の']], [['gear'], ['伝動装置，動力伝達装置']], [['block'], ['を妨げる，を阻害する']], [['unless'], ['でない限り，除いて']], [['willing'], ['いとわない，快諾する']], [['negotiate'], ['交渉する，協議する']], [['doubt'], ['疑い，疑問']], [['afford'], ['余裕がある，ゆとりがある']], [['wage'], ['賃金，報酬']], [['abortion'], ['中絶，妊娠中絶']], [['strange'], ['奇妙な，異常な']], [['estate'], ['財産，資産']], [['addition'], ['追加，付加']], [['smart'], ['頭の良い，きちんとした']], [['bind'], ['縛りつける，束ねる']], [['shed'], ['流す，排出する']], [['citizen'], ['市民，国民']], [['summit'], ['頂上，山頂']], [['battery'], ['電池，蓄電池']], [['complexity'], ['複雑さ，錯綜さ']], [['reduction'], ['削減，減少']], [['disaster'], ['災害，災難']], [['comfort'], ['快適さ／慰める']], [['founder'], ['創設者，創立者']], [['assault'], ['暴行，攻撃']], [['broadcast'], ['放送する，発信する']], [['critic'], ['批評家，評論家']], [['friendly'], ['友好的な，親切な']], [['consequently'], ['その結果として，それゆえに']], [['urban'], ['都会の，市内の']], [['detailed'], ['詳細の，具体的な']], [['primitive'], ['原始的な，先史的な']], [['electrical'], ['電気の，電気を用いた']], [['afraid'], ['心配して，恐れて']], [['community'], ['共同社会，共同体']], [['connect'], ['つなげる，接続する']], [['scheme'], ['計画，企画']], [['language'], ['言語，語言']], [['colleague'], ['同僚，仲間']], [['stroke'], ['打撃，衝撃']], [['servant'], ['使用人，召使']], [['belief'], ['信念，信条']], [['inflation'], ['膨張，拡大']], [['Muslim'], ['イスラム教徒，ムスリム']], [['upset'], ['気持ちが動揺した，ひっくり返す']], [['inquiry'], ['問い合わせ，質問']], [['apply'], ['適用する，応用する']], [['failure'], ['失敗，挫折']], [['seed'], ['種子，種']], [['potentially'], ['潜在的に，可能性として']], [['cultivate'], ['耕作する，耕す']], [['awful'], ['ひどい，恐ろしい']], [['mate'], ['友達，仲間']], [['military'], ['軍隊，兵力']], [['armed'], ['武装した，装備した']], [['lung'], ['肺']], [['sequence'], ['連続，継続']], [['impress'], ['感銘を与える，感動させる']], [['Mexican'], ['メキシコの，メキシコ系の']], [['suffering'], ['苦しみ，悩み']], [['well-known'], ['よく知られた，有名な']], [['associate'], ['結びつけて考える，賛同する']], [['lord'], ['領主，支配者']], [['governor'], ['知事，州知事']], [['permanent'], ['永久の，永遠の']], [['bishop'], ['司教，教会の指導者']], [['background'], ['背景，背後']], [['beg'], ['懇願する，願い出る']], [['relevant'], ['関連のある，適切な']], [['recognition'], ['認識，認知']], [['sharp'], ['鋭い，先鋭的な']], [['legal'], ['法律の，法的な']], [['criticize'], ['を批評する，を評価する']], [['naked'], ['裸の，無防備な']], [['symptom'], ['症状，兆候']], [['raw'], ['生の，未加工の']], [['association'], ['協会，連合']], [['phase'], ['段階，レベル']], [['politics'], ['政治，政策']], [['atmosphere'], ['雰囲気，気候']], [['lap'], ['ひざ，膝小僧']], [['clerk'], ['事務員，社員']], [['fault'], ['欠点，短所']], [['toward'], ['向かって，のほうへ']], [['foreign'], ['外国の，海外の']], [['global'], ['地球の，世界の']], [['hire'], ['雇う，採用する']], [['item'], ['項目，要点']], [['dislike'], ['嫌がる，嫌い']], [['unknown'], ['未知の，分からない']], [['nearby'], ['近くの，隣近所の']], [['traditional'], ['伝統的な，慣習的な']], [['liberty'], ['自由，独立']], [['toe'], ['つま先，足の指']], [['log'], ['丸太，円木']], [['appoint'], ['任命する，指定する']], [['courage'], ['勇気，勇猛']], [['quarter'], ['四半期，四分期']], [['affair'], ['事柄，問題']], [['snap'], ['パチンと鳴らす，カチンと鳴らす']], [['tale'], ['お話，物語']], [['educational'], ['教育の，教授の']], [['hardly'], ['ほとんどない，少ない']], [['conclusion'], ['結論，最終的な判断']], [['whereas'], ['である一方で，だが一方で']], [['custom'], ['習慣，慣例']], [['biological'], ['生物学上の，生物的な']], [['confine'], ['制限する，限定する']], [['beneath'], ['の下に，以下に']], [['extinction'], ['絶滅，消失']], [['tiny'], ['ごく小さい，微小な']], [['election'], ['選挙，投票']], [['charm'], ['魅力，引力']], [['palm'], ['手のひら，（動物の）前足の裏']], [['mean'], ['を意味する，を示す']], [['advertise'], ['宣伝する，広告する']], [['advertising'], ['広告，宣伝']], [['factor'], ['要因，原因']], [['curious'], ['好奇心が強い，探究心が強い']], [['pitch'], ['投げる，放る']], [['excessive'], ['過度の，極端な']], [['war'], ['戦争，衝突']], [['apparently'], ['明らかに，明確に']], [['boundary'], ['境界，限界']], [['procedure'], ['手続き，手順']], [['consumer'], ['消費者，利用者']], [['satisfactory'], ['満足のいく，充足する']], [['echo'], ['こだま，反響']], [['essay'], ['論文，随筆']], [['extension'], ['拡張，展開']], [['atomic'], ['原子の，素粒子の']], [['sigh'], ['ため息をつく，ため息を出す']], [['sophisticated'], ['洗練された，高雅な']], [['considerable'], ['かなりの，相当な']], [['explain'], ['を説明する，を解説する']], [['bet'], ['賭ける，博打をする']], [['plant'], ['植物，草木']], [['scatter'], ['まき散らす，ばらまく']], [['admire'], ['を賞賛する，を賛美する']], [['largely'], ['主として，主に']], [['rear'], ['後部の，背後の']], [['bond'], ['拘束，束縛']], [['authority'], ['権威，権力']], [['medium'], ['中間の，中央の']], [['adapt'], ['に適合させる，調整する']], [['resist'], ['抵抗する，反発する']], [['folk'], ['人々，群衆']], [['poet'], ['詩人，作詩者']], [['resolve'], ['解決する，を決心する']], [['detail'], ['詳細，具体的な情報']], [['priority'], ['優先度，優越性']], [['`false'], ['誤った，間違った']], [['prisoner'], ['囚人，受刑者']], [['apparent'], ['外見上の，明白な']], [['lab'], ['研究室，研究所']], [['squeeze'], ['絞る，押しつぶす']], [['status'], ['状態，身分']], [['pension'], ['年金，老後の資金']], [['unique'], ['他に類を見ない，唯一の']], [['eliminate'], ['を取り除く，を排除する']], [['patch'], ['当て布，布切れ']], [['observation'], ['観察，観測']], [['dozen'], ['12の']], [['airline'], ['航空会社，航空業者']], [['flow'], ['流れる，流す']], [['independent'], ['独立した，自立した']], [['president'], ['社長，大統領']], [['socially'], ['社会的に，社会的観点から']], [['settle'], ['決着させる，解決する']], [['ideal'], ['理想，目指すべき状態']], [['address'], ['住所，居住地']], [['pray'], ['祈る，願う']], [['ray'], ['光線，放射線']], [['maker'], ['製造元，製作者']], [['combat'], ['戦闘，闘争']], [['ministry'], ['省庁，官庁']], [['explosion'], ['爆発，爆裂']], [['cure'], ['治療する，療養する']], [['public'], ['公共の，共有の']], [['reach'], ['到着する，辿り着く']], [['impact'], ['影響，衝撃']], [['union'], ['統合，一致']], [['author'], ['著者，作者']], [['thick'], ['厚い，肥厚な']], [['presence'], ['存在，存在感']], [['incorporate'], ['合体させる，統合する']], [['rent'], ['家賃，賃料']], [['radical'], ['急進的な，抜本的な']], [['economics'], ['経済学，財政学']], [['trust'], ['信頼，信用']], [['virus'], ['ウイルス，病原体']], [['party'], ['政党，党派']], [['pupil'], ['生徒，学生']], [['unusual'], ['珍しい，異常な']], [['meal'], ['食事，食事療法']], [['neighbor'], ['隣人，近隣住民']], [['civil'], ['市民の，住民の']], [['counter'], ['に対抗する，に立ち向かう']], [['suicide'], ['自殺，自害']], [['protein'], ['タンパク質，タンパク物質']], [['poll'], ['投票，選挙']], [['mutual'], ['相互の，互いの']], [['vote'], ['投票する／投票権']], [['attend'], ['出席する，付き添う']], [['regret'], ['後悔する／後悔，遺憾']], [['academic'], ['学術の，大学の']], [['supreme'], ['最高の，至高の']], [['comfortable'], ['心地の良い，快適な']], [['involvement'], ['関与，関わり合い']], [['crowd'], ['群衆，大衆']], [['emotional'], ['感情の，情緒の']], [['revenue'], ['収益，所得']], [['neighborhood'], ['近所，近隣']], [['concern'], ['心配する，に関係する']], [['remember'], ['覚えている，を思い出す']], [['guilty'], ['有罪の，罪のある']], [['fascinate'], ['魅了する，魅惑する']], [['trigger'], ['引き金，誘因']], [['distinction'], ['区別，相違']], [['transform'], ['を変える，を改変する']], [['transfer'], ['を移す，を転送する']], [['order'], ['命令，指令']], [['hide'], ['隠す，隠れる']], [['solid'], ['固い，固形の']], [['plain'], ['簡素な，わかりやすい']], [['ease'], ['容易さ，気楽さ']], [['stretch'], ['広がる，拡大する']], [['amendment'], ['修正，改訂']], [['frighten'], ['怖がらせる，恐れさせる']], [['heel'], ['かかと，きびす']], [['perceive'], ['知覚する，感じる']], [['rational'], ['理性的な，合理的な']], [['faith'], ['信頼，信用']], [['conviction'], ['信念，確信']], [['agent'], ['代理人，代表者']], [['rural'], ['田舎の，農村の']], [['pioneer'], ['開拓者，先駆者']], [['humanity'], ['人間，人間性']], [['within'], ['以内で，内部で']], [['respect'], ['尊敬，敬意']], [['sweep'], ['掃く，払う']], [['display'], ['展示する，陳列する']], [['own'], ['自身の，自分自身の']], [['disappoint'], ['がっかりさせる，失望させる']], [['hang'], ['つるす，掛ける']], [['transition'], ['遷移，変遷']], [['decision'], ['決定，結論']], [['aware'], ['気づいている，知っている']], [['reward'], ['褒美，報酬']], [['uncomfortable'], ['心地の悪い，不快な']], [['civilized'], ['発達した文明をもつ，教養の高い']], [['aggressive'], ['攻撃的な，侵略的な']], [['infant'], ['乳児，赤ちゃん']], [['means'], ['手段，方法']], [['useless'], ['役に立たない，むだな']], [['briefly'], ['簡単に，手短に']], [['site'], ['場所，地点']], [['nature'], ['自然，天然']], [['dialect'], ['方言，地域言語']], [['genius'], ['天才，才人']], [['conduct'], ['行為，行動']], [['insect'], ['昆虫，虫']], [['demonstrate'], ['実証する，証明する']], [['painful'], ['苦痛な，痛い']], [['circuit'], ['回路，巡回']], [['regime'], ['政権，政府']], [['awake'], ['目を覚ましている，覚醒している']], [['useful'], ['役に立つ，有用な']], [['entertainment'], ['娯楽，楽しみ']], [['express'], ['表現する，を言い表す']], [['sacrifice'], ['犠牲，捧げ物']], [['devise'], ['考え出す，工夫する']], [['intimate'], ['親密な，密接な']], [['seldom'], ['めったに～しない，稀に']], [['criticism'], ['批判，評価']], [['price'], ['値段，価格']], [['invisible'], ['見えない，不可視な']], [['present'], ['現在の，出席して']], [['somehow'], ['どうにか，何とか']], [['agreement'], ['同意，賛成']], [['although'], ['だけれども，しかし']], [['advocate'], ['提唱する，主張する']], [['increasingly'], ['ますます，更に']], [['govern'], ['統治する，支配する']], [['electronic'], ['電子の，電子式の']], [['necessarily'], ['必然的に，必ず']], [['severe'], ['厳しい，厳格な']], [['convenient'], ['都合がよい，便利な']], [['due'], ['期限の，納期の']], [['coast'], ['海岸，沿岸地域']], [['extreme'], ['極端な，過激な']], [['relief'], ['安堵，軽減']], [['edge'], ['端，縁']], [['vice'], ['副担当の，代理の']], [['national'], ['国の，国民の']], [['vulnerable'], ['傷つきやすい，繊細']], [['evolution'], ['進化，発展']], [['slight'], ['かすかな，わずかの']], [['rely'], ['頼る，依存する']], [['globe'], ['地球，地球体']], [['constitution'], ['憲法，構成，組織']], [['prompt'], ['即座の，直ちに']], [['restriction'], ['制限，限定']], [['rapid'], ['急速な，急激な']], [['inspector'], ['検査官，監査人']], [['essentially'], ['本質的に，根本的に']], [['select'], ['を選び出す，を選ぶ']], [['carbon'], ['炭素，炭素素子']], [['sudden'], ['突然の，急な']], [['deliberately'], ['故意に，慎重に']], [['significant'], ['重要な，大切な']], [['employ'], ['雇う，採用する']], [['latest'], ['最新の，最先端の']], [['tough'], ['頑強な，丈夫な']], [['tide'], ['潮，潮流']], [['asset'], ['資産，財産']], [['origin'], ['起源，由来']], [['popular'], ['人気のある，評判の良い']], [['colony'], ['植民地，入植地']], [['distribution'], ['分布，配分']], [['plot'], ['話の筋，物語の筋']], [['mortgage'], ['抵当，担保']], [['drug'], ['麻薬，薬']], [['possibly'], ['ひょっとすると，もしかしたら']], [['advice'], ['助言，忠告']], [['industrialize'], ['産業化する，工業化する']], [['complain'], ['不満を言う，不平を言う']], [['county'], ['州，郡']], [['supporter'], ['支援者，後援者']], [['federal'], ['連邦の，連邦制の']], [['fur'], ['毛皮，皮毛']], [['commercial'], ['商業の，商取引の']], [['aggression'], ['攻撃性，侵略']], [['entire'], ['全体の，全部の']], [['silly'], ['馬鹿な，愚かな']], [['brick'], ['れんが，れんが状のもの']], [['basis'], ['土台，根拠']], [['protect'], ['を守る，保護する']], [['confirm'], ['確認する，確かめる']], [['broad'], ['広い，拡大する']], [['prior'], ['優先の，前の']], [['consequence'], ['結果，影響']], [['pretty'], ['かなり，相当に']], [['manufacturer'], ['製造元，製造業者']], [['exhibition'], ['展示，展覧']], [['cruise'], ['巡航する，航行する']], [['extraordinary'], ['普通でない，異常な']], [['leisure'], ['余暇，自由時間']], [['multiple'], ['掛け算する，乗算する']], [['variation'], ['変化，変動']], [['suit'], ['適合する，合致する']], [['teenager'], ['十代，少年期']], [['bare'], ['裸の，露出の']], [['minority'], ['少数派，少数群']], [['rapidly'], ['素早く，迅速に']], [['odd'], ['変な，奇妙な']], [['lawn'], ['芝生，草地']], [['consist'], ['成り立つ，構成する']], [['duty'], ['職務，関税']], [['period'], ['期間，周期']], [['comprehensive'], ['包括的な，理解力のある']], [['achievement'], ['達成，成就']], [['sum'], ['合計，総計']], [['seem'], ['の様に見える，思われる']], [['implement'], ['実施する／道具，手段']], [['interior'], ['内部の，内側の']], [['calculate'], ['計算する，算出する']], [['dominate'], ['を支配する，を統制する']], [['obligation'], ['義務，責任']], [['joy'], ['喜び，歓喜']], [['throat'], ['のど，咽喉']], [['imagination'], ['想像，仮想']], [['democrat'], ['民主主義者，民主派']], [['chapter'], ['章，区切り']], [['hell'], ['地獄，奈落']], [['lean'], ['傾く，寄りかかる']], [['pan'], ['フライパン']], [['blast'], ['爆風，突風']], [['exist'], ['存在する，実在する']], [['politician'], ['政治家，政府要人']], [['industrial'], ['産業の，工業の']], [['merchant'], ['商人，販売者']], [['assembly'], ['集合，群集']], [['focus'], ['焦点，中心']], [['actual'], ['現実の，事実の']], [['universe'], ['宇宙，宙域']], [['nerve'], ['神経，神経線']], [['mostly'], ['主に，ほとんど']], [['criminal'], ['犯罪の，違法の']], [['passage'], ['一節，節分']], [['logic'], ['論理，理論']], [['arise'], ['起こる，現れる']], [['whatever'], ['なんでも，何もかも']], [['rebel'], ['反逆者，造反者']], [['encounter'], ['遭遇する，出会う']], [['depress'], ['落胆させる，失望させる']], [['widely'], ['広範囲に，多くの範囲に']], [['expansion'], ['拡張，拡大，増幅']], [['existence'], ['存在，実在']], [['peculiar'], ['奇妙な，変わった']], [['strict'], ['厳しい，厳格な']], [['firm'], ['しっかりした，堅い']], [['desperate'], ['やけくその，軽率な']], [['sort'], ['種類，類']], [['personally'], ['個人的に，本人自ら']], [['urge'], ['強く促す，早める']], [['blood'], ['血，血液']], [['institution'], ['制度，設立']], [['facility'], ['施設，手洗い，便利さ']], [['crew'], ['乗組員，船員']], [['index'], ['索引，目次']], [['unpleasant'], ['不愉快な，不快な']], [['etc'], ['等々，などなど']], [['elementary'], ['初級の，入門の']], [['viewer'], ['観察者，視聴者，監視人']], [['spiritual'], ['精神の，心の']], [['conference'], ['会議，対話']], [['freeze'], ['凍る，氷結']], [['debate'], ['討論，議論']], [['swallow'], ['を飲み込む，嚥下する']], [['convey'], ['伝える，運ぶ']], [['honor'], ['名誉，特権，栄誉']], [['concrete'], ['具体的な，明確な']], [['laboratory'], ['実験室，研究所']], [['capable'], ['可能性がある，才能のある']], [['treasure'], ['宝，財産']], [['reserve'], ['を取っておく，を保管する']], [['phenomenon'], ['現象，事象']], [['chest'], ['たんす，チェスト']], [['bite'], ['を噛む，かじる']], [['proper'], ['適切な，ふさわしい']], [['rub'], ['こする，さする']], [['shortly'], ['まもなく，近々']], [['term'], ['期間，専門用語']], [['psychological'], ['心理的な，精神的な']], [['right'], ['正しい，正確な']], [['inclined'], ['傾いた，(し)がちで']], [['attract'], ['引きつける，魅了する']], [['headquarters'], ['本部，中心']], [['highlight'], ['目立たせる，最も明るい部分']], [['owe'], ['を借りている，借用する']], [['accustomed'], ['慣れている，いつもの']], [['portion'], ['部分，一部分']], [['mad'], ['狂った，狂気じみた']], [['buyer'], ['買い手，購入者']], [['till'], ['まで，至る']], [['destruction'], ['破壊，壊滅']], [['injury'], ['怪我，負傷']], [['confusion'], ['混乱，無秩序']], [['employer'], ['雇用者，雇い主']], [['crop'], ['収穫物，作物']], [['nervous'], ['神経質な，びくびくして']], [['companion'], ['仲間，同志']], [['distance'], ['距離，間隔']], [['impression'], ['印象，感じ']], [['confront'], ['直面させる，に立ち向かう']], [['path'], ['小道，細道']], [['suppress'], ['抑える，抑圧する']], [['decline'], ['断る，拒否する']], [['truth'], ['真実，事実']], [['intellectual'], ['知的な，知識に関する']], [['jail'], ['刑務所，拘置所']], [['cease'], ['やめる，中止する']], [['pile'], ['積み重ね，累積']], [['cover'], ['を覆う，隠す']], [['finance'], ['財政，財務']], [['cast'], ['投げる，放る']], [['distinct'], ['他と違った，別の']], [['conservation'], ['保全，保護']], [['prosecutor'], ['検察官，検事']], [['task'], ['仕事，職業']], [['initially'], ['最初は，初めて']], [['behalf'], ['代わって，の代わりに']], [['region'], ['地域，領域']], [['prefer'], ['より好む，好む']], [['perspective'], ['見解，見通し']], [['income'], ['所得，収入']], [['identical'], ['同一の，全く同じの']], [['impressive'], ['印象的な，鮮烈な']], [['polite'], ['礼儀正しい，丁寧な']], [['executive'], ['実行する，実施する']], [['rough'], ['ごつごつした，粗い']], [['proposed'], ['提案した，提供した']], [['province'], ['州，地方']], [['personality'], ['人格，性格']], [['stake'], ['くい，掛け金']], [['goal'], ['目標，目的']], [['girlfriend'], ['女友達，女の友人']], [['forward'], ['前方へ，前に']], [['narrow'], ['幅が狭い，細い']], [['divorce'], ['離婚／離婚する']], [['apart'], ['離れて，遠くに']], [['emphasis'], ['強調，重視']], [['shooting'], ['撮影，射撃']], [['inhabitant'], ['居住者，住人']], [['recession'], ['不況，後退']], [['passive'], ['受身の，消極的な']], [['subtle'], ['微妙な，繊細な']], [['competitive'], ['競争力のある，競争による']], [['clothing'], ['衣料品，服']], [['wise'], ['賢い，賢明な']], [['pursuit'], ['追跡，追跡行為']], [['settlement'], ['移住，定住']], [['seize'], ['つかむ，把握する']], [['partnership'], ['共同，提携']], [['expression'], ['表現，言い回し']], [['dispute'], ['争議／論争する']], [['contrary'], ['反対の，逆の']], [['expand'], ['拡大する，広がる']], [['intelligence'], ['知能，知性']], [['shortage'], ['不足，欠乏']], [['compound'], ['調合する，調合品を作る']], [['defeat'], ['負かす，打ち破る']], [['assumption'], ['想定，仮説']], [['sustain'], ['保持する，維持する']], [['initiative'], ['主導権，自発性']], [['bow'], ['お辞儀する，頭を下げる']], [['examination'], ['試験，実験']], [['confidence'], ['自信，信頼']], [['yield'], ['産出する，生ずる']], [['firmly'], ['堅く，確固として']], [['engaged'], ['に従事して，忙しくして']], [['impulse'], ['衝動，衝力']], [['destroy'], ['を破壊する，を壊す']], [['steady'], ['着実な，安定した']], [['element'], ['要素，元素']], [['dealer'], ['販売業者，売り手']], [['mysterious'], ['不可解な，不思議な']], [['comparison'], ['比較，対照']], [['communist'], ['共産主義者，共産党員']], [['republic'], ['共和国，共和制国家']], [['expose'], ['明らかにする，明示する']], [['department'], ['部門，課']], [['explanation'], ['説明，解説']], [['isolate'], ['を孤立させる，隔離する']], [['proceed'], ['進む，始める']], [['explore'], ['探索する，調査する']], [['regarding'], ['に関して，について']], [['stupid'], ['馬鹿な，愚かな']], [['alive'], ['生きている，存命の']], [['dramatic'], ['劇的な，感動的な']], [['potential'], ['潜在的な，潜伏している']], [['approval'], ['承認，認可']], [['dare'], ['思い切ってする，断行する']], [['activist'], ['行動主義者，活動家']], [['effectively'], ['効果的に，事実上']], [['strain'], ['張る，伸ばす']], [['shame'], ['恥，羞恥']], [['cash'], ['現金，手元資金']], [['asleep'], ['眠っている，寝ている']], [['mass'], ['塊，大部分']], [['latter'], ['後者の，後半の']], [['absolutely'], ['絶対に，必ず']], [['intention'], ['意図，目的']], [['science'], ['科学，自然科学']], [['split'], ['割る，裂く']], [['diminish'], ['減らす，小さくする']], [['positive'], ['自信のある，確信している']], [['remote'], ['遠い，遠隔の']], [['collect'], ['集める，収集する']], [['equivalent'], ['等しい，同等の']], [['bear'], ['我慢する，を圧迫する']], [['empire'], ['帝国，王国']], [['navy'], ['海軍，水軍']], [['significance'], ['重要性，意義']], [['practical'], ['実用的な，有用な']], [['guess'], ['推測する，予想する']], [['agriculture'], ['農業，耕作']], [['leap'], ['跳ぶ，はねる']], [['empty'], ['何も入っていない，空っぽの']], [['insight'], ['洞察，洞察力']], [['verbal'], ['言葉の，語句の']], [['unit'], ['単位，員数']], [['evil'], ['邪悪な，悪しき']], [['newly'], ['新たに，最近']], [['automobile'], ['自動車，乗用車']], [['university'], ['大学，大学校']], [['publication'], ['出版物，刊行物']], [['past'], ['過去の，終わった']], [['contrast'], ['対照，比較']], [['immigrant'], ['移民，移住者']], [['lack'], ['不足，欠乏']], [['brief'], ['短い，短時間の']], [['cop'], ['警官，警察官']], [['eager'], ['強く望んでいる，切望している']], [['crown'], ['王冠，王座']], [['observer'], ['観察者，傍観者']], [['nod'], ['うなずく，会釈する']], [['investment'], ['投資，出資']], [['scientific'], ['科学の，理科の']], [['constitute'], ['構成する，組み立てる']], [['moral'], ['道徳の，道徳的な']], [['voter'], ['投票者，選挙人']], [['remarkable'], ['目立った，際立った']], [['mere'], ['単なる，ただの']], [['belong'], ['に属する，所属する']], [['pursue'], ['追い求める，追跡する']], [['totally'], ['完全に，全く']], [['patient'], ['我慢強い，患者']], [['match'], ['試合，競技']], [['weather'], ['天候，天気']], [['survival'], ['生存，生き残ること']], [['fellow'], ['仲間，友人']], [['towards'], ['の方へ，向かって']], [['aircraft'], ['航空機，飛行機']], [['legislation'], ['立法，法制定']], [['wherever'], ['どこでも，どの場所でも']], [['tax'], ['税金，税収']], [['nuclear'], ['核の，中心の']], [['internal'], ['内部の，内側の']], [['enterprise'], ['会社，事業']], [['initial'], ['当初の，最初の']], [['division'], ['分割，割り当て']], [['parallel'], ['平行の，並行の']], [['preference'], ['好み，好き']], [['consideration'], ['考慮，考察']], [['expectation'], ['期待，予想']], [['literally'], ['文字通りに，直訳で']], [['grave'], ['墓，墓地']], [['laughter'], ['笑い，笑顔']], [['found'], ['設立する，創立する']], [['terror'], ['恐怖，恐れ']], [['suitable'], ['適した，好都合な']], [['reference'], ['参照，参考']], [['fabric'], ['織物，布地']], [['length'], ['長さ，延長']], [['deny'], ['を否定する，拒否する']], [['satellite'], ['衛星，人工衛星']], [['steadily'], ['着実に，確実に']], [['fundamental'], ['基本的な，基礎の']], [['strategy'], ['戦略，戦術']], [['virtually'], ['実質的に，事実上']], [['partly'], ['部分的に，一部分']], [['profession'], ['職業，仕事']], [['undergo'], ['経験する，体験する']], [['congress'], ['会議，集会']], [['given'], ['与えられた，授与された']], [['traffic'], ['交通，運輸']], [['mainly'], ['主に，もっぱら']], [['cave'], ['ほら穴，洞窟']], [['fancy'], ['空想，想像']], [['wisdom'], ['知恵，賢明さ']], [['blink'], ['瞬きをする，瞬間を過ごす']], [['scholar'], ['学者，研究者']], [['rid'], ['を取り除く，除去する']], [['privilege'], ['特権，特典']], [['method'], ['方法，手段']], [['establishment'], ['設立，創立']], [['shrug'], ['肩をすくめる，無視する']], [['aloud'], ['声に出して，大声で']], [['continue'], ['をし続ける，続ける']], [['master'], ['主人，支配人']], [['rating'], ['評価，鑑定']], [['extra'], ['余分の，特別の']], [['flee'], ['逃げる，逃走する']], [['administration'], ['機関，運営']], [['die'], ['死ぬ，亡くなる']], [['throughout'], ['至るところに，終始']], [['shit'], ['大便，便']], [['tradition'], ['伝統，慣習']], [['typical'], ['典型的な，代表的な']], [['weigh'], ['重さがある，の重さを量る']], [['unlikely'], ['起こりそうにない，ありそうもない']], [['weight'], ['重さ，体重']], [['normally'], ['通常は，普通に']], [['retain'], ['保持する，持ち続ける']], [['overwhelming'], ['圧倒的な，支配的な']], [['promotion'], ['昇進，進級']], [['massive'], ['巨大な，大規模な']], [['desirable'], ['望ましい，理想的な']], [['stare'], ['じっと見つめる，しきりに観察する']], [['application'], ['適用，応用']], [['grasp'], ['つかむ，把握する']], [['fat'], ['太った，肥満した']], [['gene'], ['遺伝子，遺因']], [['contract'], ['契約，協定']], [['discuss'], ['について議論する，検討する']], [['court'], ['裁判所，法廷']], [['analysis'], ['分析，解析']], [['generate'], ['発生させる，起こす']], [['regardless'], ['にも関わらず，不注意で']], [['fire'], ['首にする，火をつける／火，火事']], [['entitle'], ['と題する，と名づける']], [['bury'], ['埋める，充填する']], [['pit'], ['くぼみ，凹み']], [['critical'], ['極めて重要な，非常に大事な']], [['crisis'], ['危機，困難']], [['flood'], ['洪水，氾濫']], [['wildlife'], ['野生動物，野生生物']], [['wrong'], ['間違い，誤った']], [['wear'], ['身につけている，着用している']], [['earn'], ['稼ぐ，得る']], [['import'], ['輸入する，直輸入する']], [['retirement'], ['退職，引退']], [['stream'], ['流れ，水流']], [['species'], ['種，種族']], [['recovery'], ['回復，復元']], [['coalition'], ['連立，連合']], [['acquaintance'], ['知人，友人']], [['peer'], ['同僚，仲間']], [['alter'], ['を変える，を改変する']], [['absolute'], ['絶対的な，完全な']], [['secretary'], ['秘書，秘書官']], [['deserve'], ['値する，価値がある']], [['contribute'], ['に寄付する，捧げる']], [['implication'], ['含み，裏の意味']], [['calm'], ['穏やかな，静かな']], [['constantly'], ['常に，いつも']], [['famous'], ['有名な，著名な']], [['precisely'], ['正確に，精密に']], [['parking'], ['駐車場，停車場']], [['ad'], ['広告，宣伝']], [['commander'], ['司令官，指揮官']], [['rise'], ['上がる，昇る']], [['gain'], ['得る，獲得する']], [['proud'], ['自慢に思って，誇らしげな']], [['lose'], ['失う，無くす']], [['editor'], ['編集者，論客']], [['killer'], ['殺人者，凶悪犯']], [['material'], ['材料，原料']], [['breast'], ['胸部，胸']], [['appetite'], ['食欲，食い気']], [['flavor'], ['風味，味']], [['aim'], ['ねらいをつける，狙う']], [['preparation'], ['準備，用意']], [['investigation'], ['調査，研究']], [['storage'], ['倉庫，保管場所']], [['investor'], ['投資家，投資者']], [['whole'], ['全部の，すべての']], [['regulation'], ['規制，規定']], [['existing'], ['既存の，現存の']], [['fate'], ['運命，宿命']], [['accuse'], ['告発する，告発']], [['object'], ['物体，実体']], [['cope'], ['対処する，処理する']], [['racial'], ['人種の，民族の']], [['judge'], ['を判断する／裁判官']], [['disagree'], ['反対する，拒否する']], [['release'], ['解き放つ，解放する']], [['literary'], ['文学の，文芸の']], [['maybe'], ['たぶん，おそらく']], [['alliance'], ['同盟，協定']], [['thought'], ['考えること，意見']], [['comedy'], ['喜劇，茶番']], [['reply'], ['返答する，応答する']], [['gay'], ['同性愛の，同性愛者の']], [['definite'], ['明確な，限定的な']], [['attempt'], ['試み，試練']], [['commission'], ['手数料，委任状']], [['except'], ['を除いて，除外して']], [['height'], ['高さ，高度']], [['favorite'], ['特に好きな，お気に入りの']], [['harmful'], ['有害な，害のある']], [['terrible'], ['ひどい，恐ろしい']], [['dull'], ['面白みのない，鈍い']], [['context'], ['文脈，背景']], [['fold'], ['折りたたむ，畳む']], [['suggestion'], ['提案，案']], [['steam'], ['蒸気，水蒸気']], [['extensive'], ['広範な，広い範囲の']], [['mayor'], ['市長，町長']], [['funding'], ['資金調達，資本集め']], [['operator'], ['操作者，操縦者']], [['universal'], ['普遍的な，万能の']], [['exposure'], ['暴露，さらすこと']], [['pose'], ['姿勢，体勢']], [['headline'], ['見出し，表題']], [['bang'], ['ドンドン叩く／ズドンという音']], [['likely'], ['起こりそうな，可能性がある']], [['necessity'], ['必要性，必須']], [['financial'], ['財政の，財務に関する']], [['resistance'], ['抵抗，反対']], [['grammar'], ['文法，文法規則']], [['capital'], ['資本，首都']], [['intend'], ['意図する，意図して']], [['alike'], ['よく似た，類似の']], [['peak'], ['頂上，頂点']], [['educate'], ['教育する，訓練する']], [['closely'], ['綿密に，詳細に']], [['exactly'], ['正確に，正確で']], [['moment'], ['瞬間，瞬時']], [['extend'], ['延びる，延長する']], [['employee'], ['従業員，社員']], [['remaining'], ['残りの，残余の']], [['negative'], ['否定の，拒否']], [['burst'], ['破裂する，破れる']], [['portrait'], ['肖像画，顔の絵']], [['possibility'], ['可能性，実現性']], [['absence'], ['不在，欠席']], [['primary'], ['最初の，初めての']], [['inferior'], ['劣った，劣る']], [['interpretation'], ['解釈，通訳']], [['evident'], ['明らかな，明白な']], [['tribe'], ['部族，種族']], [['maintenance'], ['持続，保全']], [['passenger'], ['乗客，客']], [['profound'], ['深い，心からの']], [['significantly'], ['かなり，相当に']], [['agree'], ['同意する，承認する']], [['assure'], ['保証する，確証する']], [['dump'], ['投げ捨てる，捨てる']], [['difference'], ['違い，差分']], [['coal'], ['石炭，炭']], [['drain'], ['排出させる，排水をする']], [['acknowledge'], ['を認める，認める']], [['suspect'], ['疑う，だと思う']], [['gaze'], ['凝視する，じっと見る']], [['sure'], ['確信して，自信をもって']], [['steel'], ['鋼鉄，鉄']], [['exclude'], ['除く，排除する']], [['surgery'], ['手術，外科']], [['add'], ['足し算する，合計する']], [['load'], ['積む／積み荷']], [['inevitable'], ['避けられない，必然的']], [['female'], ['雌の，女性の']], [['depending'], ['依存している，依存状態']], [['so-called'], ['いわゆる，通称']], [['accept'], ['受け入れる，受け取る']], [['enthusiasm'], ['情熱，熱狂']], [['joint'], ['継目，関節']], [['assessment'], ['評価，査定']], [['evolve'], ['進化する，発展する']], [['occupy'], ['占める，取る']], [['mention'], ['言及する，参照する']], [['account'], ['銀行口座']], [['commodity'], ['商品']], [['grace'], ['恵み']], [['distort'], ['歪める']], [['Arctic'], ['北極地方']], [['obsession'], ['強迫観念']], [['obey'], ['従う']], [['manipulate'], ['操る']], [['sue'], ['訴える']], [['Buddhist'], ['仏教']], [['extract'], ['抜き取る']], [['indigenous'], ['原産の']], [['slavery'], ['奴隷制度']], [['avenue'], ['大通り']], [['destination'], ['目的地，行き先']], [['designate'], ['選定する']], [['domain'], ['領地']], [['infrastructure'], ['基盤']], [['provoke'], ['挑発する']], [['sole'], ['単独の']], [['convict'], ['有罪とする']], [['fatigue'], ['疲労']], [['precede'], ['先行する']], [['decent'], ['まともな']], [['utter'], ['完全な']], [['stern'], ['厳格な']], [['breed'], ['を飼育する，繁殖する']], [['forecast'], ['予測する']], [['evidence'], ['証拠']], [['otherwise'], ['さもなければ']], [['require'], ['を必要とする，を要求する']], [['architect'], ['建築家']], [['lessen'], ['減らす']], [['tumor'], ['腫瘍']], [['dormitory'], ['寮，大部屋']], [['thrust'], ['突き上げる']], [['handout'], ['配布物']], [['addicted'], ['癖になった']], [['kindergarten'], ['幼稚園']], [['reasonable'], ['理性のある，分別のある']], [['phenomenon'], ['現象']], [['accommodate'], ['収容する']], [['obscure'], ['不明瞭な']], [['aisle'], ['通路']], [['resign'], ['辞任する']], [['grocery'], ['食料品']], [['toll'], ['料金']], [['transaction'], ['取引']], [['stiff'], ['硬い']], [['induce'], ['誘発する']], [['withstand'], ['耐える']], [['sanitation'], ['衛生']], [['fraction'], ['分数']], [['conceal'], ['隠す']], [['retail'], ['小売り']], [['isolation'], ['隔離']], [['biology'], ['生物学']], [['prejudice'], ['先入観']], [['souvenir'], ['お土産']], [['supervisor'], ['上司']], [['struggle'], ['もがき苦しむ']], [['attribute'], ['に帰する']], [['subsequent'], ['その後の']], [['soak'], ['浸す']], [['supplement'], ['補足，追加']], [['drought'], ['干ばつ']], [['penetrate'], ['貫く']], [['conform'], ['従う']], [['scarce'], ['乏しい']], [['trivial'], ['取るに足らない']], [['thorough'], ['徹底した']], [['urge'], ['強く促す，早める']], [['predator'], ['捕食者']], [['beverage'], ['飲料']], [['emperor'], ['皇帝，天皇']], [['soar'], ['舞い上がる']], [['embarrassed'], ['恥ずかしい']], [['famine'], ['食料不足']], [['secondhand'], ['中古の']], [['bureau'], ['事務局，たんす']], [['extinct'], ['絶滅した']], [['roast'], ['あぶり焼きにする']], [['conquer'], ['征服する']], [['converse'], ['逆の']], [['revise'], ['改訂する']], [['lawyer'], ['弁護士，法律家']], [['dip'], ['少し浸す']], [['optimistic'], ['楽観的な']], [['neat'], ['きちんとした']], [['refer'], ['言及する']], [['expire'], ['期限切れの']], [['imperial'], ['帝国の']], [['hierarchy'], ['階層']], [['erosion'], ['侵食']], [['evoke'], ['呼び起こす']], [['chemistry'], ['化学']], [['habit'], ['習慣，慣習']], [['vanish'], ['消える']], [['medieval'], ['中世の']], [['earnest'], ['真剣な']], [['savage'], ['獰猛な']], [['spur'], ['刺激']], [['bleed'], ['出血する']], [['eyesight'], ['視界']], [['apologize'], ['謝る，謝罪する']], [['concentrate'], ['集中する']], [['utilize'], ['利用する']], [['fame'], ['名声']], [['accommodation'], ['宿泊施設']], [['donate'], ['を寄付する，を寄贈する']], [['starve'], ['飢える']], [['organ'], ['臓器']], [['domestic'], ['国内の，自国の']], [['discrimination'], ['差別／差別的な']], [['bully'], ['いじめっ子']], [['bake'], ['焼く，焼成する']], [['ambiguous'], ['あいまいな']], [['integrate'], ['統合する']], [['particle'], ['分子']], [['magnificent'], ['壮大な']], [['pastime'], ['娯楽']], [['enrich'], ['豊かにする']], [['refund'], ['払い戻す']], [['germ'], ['細菌']], [['rumor'], ['うわさ']], [['descend'], ['下降する']], [['irrelevent'], ['無関係な']], [['endow'], ['寄付する']], [['fingerprint'], ['指紋']], [['compile'], ['編集する']], [['compassion'], ['思いやり']], [['ancestor'], ['祖先，先祖']], [['sorrow'], ['悲しみ']], [['approve'], ['承認する']], [['undertake'], ['引き受ける']], [['compliment'], ['褒め言葉']], [['overwhelm'], ['圧倒する']], [['confess'], ['を打ち明ける，白状する']], [['awkward'], ['ぎこちない']], [['tame'], ['飼いならす']], [['appropriate'], ['適当な，充当する']], [['adolescent'], ['思春期の']], [['ambition'], ['野望']], [['scholarship'], ['奨学金']], [['remain'], ['のままである，残る']], [['emotion'], ['感情，情熱']], [['emergency'], ['緊急事態，緊急']], [['spouse'], ['配偶者']], [['shrink'], ['縮小する']], [['molecule'], ['分子']], [['document'], ['書類']], [['nap'], ['昼寝']], [['assemble'], ['組み立てる']], [['injection'], ['注射，注入']], [['endanger'], ['危険にさらす']], [['basin'], ['盆地']], [['suspend'], ['つるす']], [['stem'], ['幹']], [['burden'], ['負担，重荷']], [['outcome'], ['結果']], [['retrieve'], ['取り戻す']], [['tidy'], ['きちんとした']], [['reveal'], ['明らかにする']], [['afterwards'], ['その後']], [['sewage'], ['下水']], [['abolish'], ['廃止する']], [['ugly'], ['醜い']], [['modest'], ['控えめな']], [['bloom'], ['咲く']], [['holy'], ['神聖な，聖なる']], [['assign'], ['割り当てる']], [['architecture'], ['建築']], [['sparkle'], ['閃光']], [['fragment'], ['断片']], [['fare'], ['運賃']], [['prey'], ['獲物']], [['devastate'], ['荒廃させる']], [['nutrition'], ['栄養，栄養素']], [['low-income'], ['低収入の']], [['leak'], ['漏れる']], [['exert'], ['行使する']], [['protocol'], ['儀礼']], [['toxic'], ['有毒な']], [['documentary'], ['事実を記録した']], [['acute'], ['鋭角の']], [['prohibit'], ['禁じる']], [['equality'], ['平等さ']], [['organic'], ['無農薬の']], [['formula'], ['式']], [['exclusive'], ['閉鎖的な']], [['sincere'], ['誠実な']], [['vow'], ['誓い']], [['intuition'], ['直感']], [['laptop'], ['ノートパソコン']], [['outstanding'], ['並外れた，目立った']], [['tissue'], ['細胞組織，薄い織物']], [['layer'], ['層']], [['explode'], ['爆発する，破裂する，激増する']], [['irrigation'], ['灌漑']], [['altitude'], ['高度']], [['humid'], ['湿っぽい、湿度の高い']], [['hemisphere'], ['半球']], [['salty'], ['塩辛い']], [['custom'], ['習慣，慣習']], [['award'], ['賞']], [['billion'], ['10億']], [['ashamed'], ['恥じて，恥ずかしくて']], [['definitely'], ['もちろん，確かに']], [['litter'], ['ごみ']], [['invade'], ['侵略する']], [['beat'], ['打ち負かす']], [['stubborn'], ['頑固な']], [['harsh'], ['厳しい']], [['prolong'], ['延長する']], [['humble'], ['謙虚な']], [['reinforce'], ['強化する']], [['fragile'], ['もろい']], [['refuge'], ['避難']], [['bold'], ['勇敢な']], [['breeze'], ['そよ風']], [['lately'], ['最近']], [['tuition'], ['授業料，学費']], [['indicate'], ['指し示す']], [['vivid'], ['鮮やかな']], [['comprehend'], ['理解する']], [['accumulate'], ['蓄積する']], [['summon'], ['召喚する']], [['acquire'], ['を身につける']], [['pedestrian'], ['歩行者']], [['restrain'], ['抑える']], [['however'], ['しかしながら']], [['environment'], ['環境']], [['reduce'], ['を減らす']]]

  # 与えられたプレイヤーのリストでゲームを初期化
  def __init__(self, player_list):
    # プレイヤーを作成、リストに追加
    for p in player_list:
      self.game_state["players"].append({
        "name": p["name"],
        "sid": p["sid"],
        "position": 0,
        "level": 0,
        "skip": False
      })
    self.num_members = len(player_list)

    # イベントマスを作成
    size = self.game_state["goal"]
    count_5 = int(size * 0.05)
    count_4 = int(size * 0.05)
    count_3 = int(size * 0.1)
    count_2 = int(size * 0.1)
    count_1 = int(size * 0.1)
    count_0 = size - (count_5 + count_4 + count_3 + count_2 + count_1)

        # 出現数に基づいてリストを作成
    elements = ([5] * count_5 +
                [4] * count_4 +
                [3] * count_3 +
                [2] * count_2 +
                [1] * count_1 +
                [0] * count_0)
    
    shuffle(elements)

    result = []
    prev_non_zero = None

    for elem in elements:
      if elem != 0:
        # 0以外の数字が連続しないように配置
        if prev_non_zero is not None and prev_non_zero != 0:
          result.append(0)
        result.append(elem)
        prev_non_zero = elem
      else:
        result.append(elem)
        prev_non_zero = 0
        # 要素数が指定したサイズになるように調整
    while len(result) < size:
      result.append(0)

    if len(result) > size:
      result = result[:size]
    
    self.game_state["event_list"] = result

    
  def move(self, diff, player_idx):
    # スキップフラグがついてるときは移動しない
    if self.game_state["players"][player_idx]["skip"]:
      self.game_state["players"][player_idx]["skip"] = False
      return
    
    self.game_state["players"][player_idx]["position"] += diff
    self.animate(player_idx)
    self.update_state()


  def add_turn(self, diff):
    self.game_state["turn"] += diff
    self.game_state["current_player"] = self.game_state["turn"] % self.num_members
    self.update_state()


  def animate(self, player_idx):
    emit("animate", self.game_state["players"][player_idx]["sid"], broadcast=True)


  def update_state(self):
    emit("update_state", self.game_state, broadcast=True)
    self.update_player_state()
  

  def update_player_state(self):
    for player in self.game_state["players"]:
      emit("update_player_state", player, room=player["sid"])


  def update_spectator_state(self):
    spectator = {
        "name": "spectator",
        "position": 0,
        "sid": "spectator",
        "level": 0,
        "skip": "false"
    }
    emit("update_player_state", spectator, broadcast=True)


  def request_dice(self, playeridx):
    emit("request:dice", room=game.get_sid_by_playeridx(playeridx))
  

  def get_playeridx_by_sid(self, sid):
    for index, player in enumerate(self.game_state["players"]):
      if player["sid"] == sid:
        return index
    return None
  

  def get_sid_by_playeridx(self, playeridx):
    return self.game_state["players"][playeridx]["sid"]
  

  def gameover(self, playeridx):
    emit("gameover", self.game_state["players"][playeridx]["name"], broadcast=True)

  # 問題番号をランダムに取得
  def get_question_idx(self, player_idx): # TODO: プレイヤーの難易度に応じて選択
    question_list = self.question
    random_question_idx = randint(0, len(question_list) - 1)
    return random_question_idx
  
  # 正誤判定
  def judgement(self, question_idx, answer: str):
    question_list = self.question
    correct = question_list[question_idx][0][0]
    print(f"答え:{correct}")
    print(f"回答:{answer}")
    return correct == answer
  
  # 問題を送信
  def send_question(self, player_idx, question_idx):
    question_list = self.question
    question = question_list[question_idx]
    payload = {
      "content": [mask_string(question[0][0]), question[1][0]],
      "question_idx": question_idx,
      "sid": self.get_sid_by_playeridx(player_idx)
    }
    emit("request:answer", payload, broadcast=True)
  
  # 指定したプレイヤーの現在マスに応じてイベントを発生させる
  def run_event(self, player_idx: int, correct: bool):
    current_position = self.game_state["players"][player_idx]["position"]
    current_event = self.game_state["event_list"][current_position]
    print(f"Event {current_event} fired!")

    if current_event == 0:  # 正解でプラスいちマス
      if correct:
        self.move(1, player_idx)
      self.add_turn(1)
      self.request_dice(self.game_state["current_player"])
    elif current_event == 1:  # 正解でプラス2マス
      if correct:
        self.move(2, player_idx)
      self.add_turn(1)
      self.request_dice(self.game_state["current_player"])
    elif current_event == 2:  # 不正解でマイナス1マス
      if not correct:
        self.move(-1, player_idx)
      self.add_turn(1)
      self.request_dice(self.game_state["current_player"])
    elif current_event == 3:  # 不正解でマイナス2マス
      if not correct:
        self.move(-2, player_idx)
      self.add_turn(1)
      self.request_dice(self.game_state["current_player"])
    elif current_event == 4:  # 不正解で1回休み
      if not correct:
        self.game_state["players"][player_idx]["skip"] = True;
      self.add_turn(1)
      self.request_dice(self.game_state["current_player"])
    else:                     # もう1ターン
      if correct:
        self.request_dice(player_idx)
      else:
        self.add_turn(1)
        self.request_dice(self.game_state["current_player"])

  # ログを追記
  def write_log(self, text: str):
    self.game_state["log"].append(text)
      


player_list = []
game = None

@socketio.on("restart")
def restart():
  print("Restart requested!")
  global game
  global player_list
  del game
  game = None
  player_list = []
  socketio.emit("dev:restart")

@socketio.on("restart_confirmed")
def on_restart_confirmed():
  os.execv(sys.executable, ['python'] + sys.argv)


@app.route("/")
def index():
  return render_template("index.html")

@socketio.on("dice")
def on_roll_dice():
  global game
  idx = game.get_playeridx_by_sid(request.sid)

  # サイコロを振る
  diced = randrange(1, 6)
  game.write_log(f"プレイヤー " + game.game_state["players"][idx]["name"] + " がサイコロを振りました！")
  game.write_log(f"サイコロの目は {diced} でした")

  # プレイヤーを動かす
  game.move(diced, idx)
  if game.game_state["players"][idx]["position"] >= game.game_state["goal"]:
    game.gameover(idx)
    return
  
  game.send_question(idx, game.get_question_idx(idx))
  print("After dice")    
  print(game)
  print(player_list)


@socketio.on("join")
def on_join(playername):
  global player_list
  player_list.append({"name": playername, "sid": request.sid})
  emit("update_player_list", player_list, broadcast=True)
  print(f"Player {playername} joined!")
  print("After join")
  print(game)
  print(player_list)


@socketio.on("start")
def on_start():
  global game
  global player_list
  idx = 0
  game = Game(player_list)
  emit("request:dice", room=game.game_state["players"][idx]["sid"])
  emit("started", broadcast=True)
  game.update_state()
  print("Game start requested and START!")
  print(f"Dice requested to player {idx}!")
  print("After start")
  print(game)
  print(player_list)

@socketio.on("answer")
def on_answer(answer):
  global game
  user_input = answer["answer"]
  q_idx = answer["question_idx"]
  p_idx = game.get_playeridx_by_sid(request.sid)
  print(f"User Answered question {q_idx}: {user_input}")
  game.write_log("プレイヤー " + game.game_state["players"][p_idx]["name"] + " が問題に答えました！ 回答：{user_input}")
  judge = game.judgement(q_idx, user_input)
  game.write_log("正解です！" if judge else "不正解です... 正解は " + str(game.question[q_idx][0][0]) + "でした")
  game.write_log("解説：...（今後追加予定）...")

  game.run_event(p_idx, judge)
  print("After answer")
  print(game)
  print(player_list)

def mask_string(word: str):
    if len(word) <= 1:
        return word  # 文字数が1以下ならそのまま返す

    # 残す文字のインデックスをランダムに選択
    reveal_index = randint(0, len(word) - 1)

    # "●" に置き換える処理
    masked_word = ''.join([char if i == reveal_index else '●' for i, char in enumerate(word)])

    return masked_word

port = int(os.environ.get("PORT", 5555))
socketio.run(app, host="0.0.0.0", port=port, debug=True, allow_unsafe_werkzeug=True)